Revit 2026 API

# LayoutRuleFixedNumberNumberOfLines Property

---

Get or set the number of the beams in a beam system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumberOfLines { get; set; }
```
```vb
Public Property NumberOfLines As Integer
	Get
	Set
```
```cpp
public:
property int NumberOfLines {
	int get ();
	void set (int value);
}
```
```fsharp
member NumberOfLines : int with get, set
```

#### Property Value

Int32

The number must be positive.

#### Reference

LayoutRuleFixedNumber Class

Autodesk.Revit.DB Namespace